[
    {
        "title": "Apple MacBook Air Laptop with M2 chip: 34.46 cm (13.6-inch) Liquid Retina Display, 8GB RAM, 512GB SSD Storage, Backlit Keyboard, 1080p FaceTime HD Camera. Works with iPhone/iPad; Space Grey",
        "reviews": [
            "Received a new product , as described , seller was Clicktech Retail Limited , go for it, better than any windows laptop at productivity",
            "Good but small",
            "After extensive research and comparison (between galaxy book 2 pro 360 & m2 air, I decided to buy M2 air, I should say I am NOT disappointed with this decision. It's a Superb Machine.",
            "No second thoughts. Best performance and smooth touch. After 10 days of use, feels like working with masterpiece machine. Best performance. Little costly but worth it once you start using.",
            "",
            "If you have a macbook air from 2019 or any older model than that, upgrade to this. This also runs FCPX remarkably well. The screen size however is a disappointment for me. Go for 16 inches if you can afford."
        ]
    },
    {
        "title": "ASUS TUF Gaming A15, AMD Ryzen 7 7435Hs, 15.6-Inch, FHD 144Hz, Gaming Laptop (16GB RAM/512GB SSD/NVIDIA Geforce RTX 3050/Windows 11/48WHR/Graphite Black/2.3 Kg), FA506NCR-HN054W",
        "reviews": [
            "I've been using the ASUS TUF Gaming A15 with AMD Ryzen 7 7435HS for a few weeks now, and I'm impressed by its raw power and features. Here's my detailed review:\n\nPros:\n\n- Lightning-Fast Performance: The Ryzen 7 7435HS processor handles demanding games and tasks with ease, providing seamless gaming and content creation experiences.\n- Immersive Gaming: The NVIDIA GeForce RTX 3060 graphics card delivers stunning visuals, and the 144Hz display ensures smooth gameplay.\n- Long-Lasting Battery: The laptop lasts up to 6 hours on a single charge (Regular use), making it perfect for long gaming sessions or work trips.\n- Ergonomic Design: The TUF Gaming A15's rugged design and comfortable keyboard make it ideal for extended use.\n- Affordable: Considering its specs and performance, this laptop is a great value for money.\n\nCons:\n\n- Thermal Management: The laptop can get hot during intense gaming sessions, but the dual-fan design helps keep temperatures in check.\n- Webcam Quality: The webcam could be better, but it's not a deal-breaker for me.\n\nOverall, the ASUS TUF Gaming A15 is an excellent choice for gamers and content creators seeking a powerful, feature-packed laptop without breaking the bank. Its performance, display, and battery life make it a top contender in its class.\n\nRecommendation: If you're looking for a reliable gaming laptop with impressive specs, look no further than the ASUS TUF Gaming A15.\n\nRating Breakdown:\n\n- Performance: 5/5\n- Display: 5/5\n- Battery Life: 4.5/5\n- Design: 4.5/5\n- Value: 5/5\n\nWould I recommend it? Absolutely!\nRead more",
            "I was sort of worried about Amazon's delivery, but it turned out amazing! The product arrived 2 days early and in perfect condition.\nPerformance is outstanding without a doubt. For the price the 4050 is amazing. Although, min. of 8GB VRAM would have been appreciated but regardless, great deal. Minecraft (all settings max. render distance 16 and BSL shaders) gives 90 - 100 fps easily.\n\nWithout the iGPU, the battery life does suffer. With normal use (content, office apps etc), you could get around 3 - 4 hours of battery. Heads up: This comes with the big plug (the 16A one they use with ACs and microwaves, so you'd have to install a separate plug for it)\n\nThe speakers were so bad I couldn't stand using them for 3 minutes. Even with Dolby enabled, it didn't make much difference. I recommend using FxSound which is available on Microsoft Store and makes the speakers much better.\n\nThe top is made of metal and the overall build is very sturdy. Can't really hold it with one hand for too long but still lighter than flagship gaming laptops.\n\nDisplay is very good indoors but a nightmare outdoors. Colors are amazing on the display though.\nRead more",
            "Hi guys, Here is my review after using this laptop.\n\nLaptop pro's - Design, price and performance.\n\nLaptop design - This laptop's design feels premium and nice.\n\nLaptop performance - It can handle GTA 5 smoothly. Also can record gameplay.\n\nLaptop thermals - Laptop gets hot only during gaming. But it doesn't over heat as far as I used.\n\nLaptop con's - I noticed some bugs/glitches like cursor while using in typing area or text box it gets white or kinda invisible I feel this maybe a bug.\n\n-Screen goes off for a second sometimes while playing videos or browsing especially in battery power.\n\n-Blue screen error: I have faced blue screen error two times till now while switching from power mode to battery mode(plugging out adapter).\nRead more",
            "I bought an Asus TUF GAMING 15 from amazon on 16/10/2024. After 5 days it had many problems (it suddenly shut down, I thought the battery must have run out, so I charged the laptop and turned it on (it turned on after 5 minutes and the battery was still 40%) and after 1 hour windows crashed and after 1 day windows crashed 3 times, and keyboard light is not working properly ,then I sent it for replacement and AMAZON people said that the tech technician would visit on 27/10/2024 but the technician did not come on the 27th, I contacted Amazon on 1st Nov, they said that your product will be refunded, the DELHIVERY agent will pick up your product on 2nd Nov, but they are not picked my product PLEASE REFUND ME MY MONEY\nRead more",
            "This laptop is worth for playing high level games, and it is super performing in coding, editing,etc...\nSound quality are best, think about weight, but it has military grade, having 2050 rtx, not soo bad, if you are thinking for mostly to do more studies work, editing, and less games it may helpful.\nHeating may occur due to high end level games, make sure to buy any cooling pad, battery according to this laptop is good compared to other gaming laptop, due to its lower graphics card.\nCharing is must for a better gameplay, editing, or to perform well, and there is a \"battery care mode\" on Myasus app, for reducing heat as well as for best battery longetivity, make sure to on it. Appearance is nice for gamers and having aura blacklit sync!!\nThis review may be helpful for you about this laptop, it is worth as it has ryzen 7 7000 series as other laptops have most cost than this!!\nTop notch\n5/5 stars!!!",
            "Performance wise good but battery backup is very poor. If battery backup will increase it will be one among the best laptops.",
            "Best quality,even after 5 hour gaming no Heat , display quality is excellent , very smooth, value for money,the only issue is battery 🔋 backup is low"
        ]
    },
    {
        "title": "Acer Aspire Lite AMD Ryzen 5-5625U Premium Thin and Light Laptop (16 GB RAM/512 GB SSD/Windows 11 Home) AL15-41, 39.62 cm (15.6\") Full HD Display, Metal Body, Gray, 1.59 KG",
        "reviews": [
            "I recently purchased the Acer Aspire Lite (AL15-41) with AMD Ryzen 5-5625U, and I must say, it has exceeded my expectations!\n\n✔ Performance – With AMD Ryzen 5-5625U and 16GB RAM, this laptop handles multitasking effortlessly. Whether it’s browsing, streaming, or working on multiple applications, everything runs smoothly.\n\n✔ Speed & Storage – The 512GB SSD ensures fast boot times and quick application launches. No lags or delays!\n\n✔ Display & Build – The 15.6\" Full HD display offers sharp visuals and vibrant colors, making it perfect for work and entertainment. The metal body gives it a premium look and feels sturdy.\n\n✔ Portability – At just 1.59 kg, it’s easy to carry around, making it ideal for students and professionals.\n\n✔ Battery Life – It provides a decent battery backup, lasting around 6-8 hours on regular usage.\n\n✔ Windows 11 Experience – Comes pre-installed with Windows 11 Home, offering a smooth and modern user interface.\n\nOverall, this laptop is a fantastic choice for those looking for power, style, and reliability at a reasonable price. Highly recommended! 👍💻\nRead more",
            "very good laptop and i got in deal so its very value for money",
            "The Acer Aspire Lite AMD Ryzen 3 5300U is a sleek, powerful, and lightweight laptop perfect for work and entertainment. With a premium metal body, vibrant 15.6” Full HD display, and just 1.6 kg weight, it’s easy to carry around. The Ryzen 3 processor, 16 GB RAM, and 512 GB SSD ensure smooth multitasking and fast performance. Pre-installed with Windows 11, it offers a modern, user-friendly experience. Ideal for students, professionals, and everyday users, this laptop strikes a perfect balance between performance and portability. A great value for its prices",
            "I've got the ryzen 3 5000 series 8gb variant in july 2024\n\nIt has been 2 days of using it\nThe built quality of my unit is intact,no damage or scratches so far since delivery\n\nComing from using IPS display in desktop and amoled in cellphone the screen quality of the laptop feels dull but knowing what i paid for and got,I'm ok with it. if anyone is planning to get this product they will get used to the display quality eventually\n\nI haven't installed anything yet and feel it's bit laggy but I'm ok with it,as I don't play games and will use it for online work and other productive work which don't require that much memory(although RAM can be extended in this model), people should go for the 16gb ram varient if availability of ryzen 3 5000 is there,under 31k or less\n\nBattery backup is about 3/4 hours of average usage, but more backup can be achieved according to usage patterns, adjusting screen brightness in a new unit as it gets older battery degradation will happen eventually as backup of the laptop\n\nWiFi is working fine so far, haven't tried bluetooth function yet\n\nSpeaker is of average quality but on softer side,what i felt\ncould have been a little louder\n\nKeyboard is without backlit and responsive, if you have big hands and fingers then it might be an issue(buy an external keyboard and mouse)like me and this will solve the inconvenience and longevity of keyboard and trackpad of laptop\n\nAll the ports and jack are working fine\n\nWhat i had seen in videos and reviews, i thought they will provide a 45watt charger but they have provided with 65 watt charger which charges quite fast, which is a plus point but still it takes about 2 hrs 10 min to fully charged from 7% to 100% in my case(with wifi/ bluetooth off and no apps running in background with 25 to 30% screen brightness)\n\nIt doesn't come with lifetime validity of MS office you have to buy after free trail period or find a cracked one from local computer stores\n\nOverall you can buy the laptop if you are in a budget with decent built,fast charging,full HD screen and average performance under 27000 then go for it,you can also get it under 25000 during sale seasons using bank cards and exchange offers\n\nIn future I will update my review or post a comment if something unusual things come by with the laptop\nRead more",
            "Pros:-Offer better product compare to other companies in same price. Smooth functioning, good battery life, processor performed well, hd screen gives soothing effect to eyes, very comfortable keypad.\nCons-company should provide a laptop bag",
            "I recently purchased this laptop and found it Totally worth the price—great value for money. Best laptop in this price segment. I bought it for 32000 . You can Go for it! I bought the 16GB RAM, 512GB SSD, and an AMD Ryzen 5 5625U version. The performance is snappy, handling multitasking, research, and content creation effortlessly. The display is sharp, and the keyboard is comfortable for extended writing sessions. Battery life is solid, allowing uninterrupted work. Overall, this Acer laptop is a fantastic investment, striking the perfect balance between power, efficiency, and affordability",
            "\"Acer Aspire lite \" when it delivered it was heat in condition. Laptop having heating problem. Similarly Keyboard is without backlit & functionality is below average.",
            "Purchased it last year , here's my review for this laptop after using is around 6 months :-\n\nPros- it's perfect for daily college usage and look premium, battery backup is also pretty good, easy to carry around\n\nCons- build quality of laptop is not good, you can feel keyboard bending when you press keys so you have to use external keyboard\n\nOverall in this price range this is a good laptop"
        ]
    }
]